app/Controllers/Admin/Dosen.php

    public function index()
    {
        $data_dosen = $this->dosenModel->findAll();
---
SELECT *
FROM `dosen`

    public function show($id = null)
    {
        return view('admin/dosen/show', [
            'title' => 'Detail Dosen',
            'page' => 'dosen',
            'dosen' => $this->dosenModel->join('users', 'users.id = dosen.user_id')->where(['dosen.id' => $id])->first(),
        ]);
---
SELECT *
FROM `dosen`
JOIN `users` ON `users`.`id` = `dosen`.`user_id`
WHERE `dosen`.`id` = '1'
 LIMIT 1

    public function edit($id)
    {
        $dosen = $this->dosenModel->where(['dosen.id' => $id])->first();
        return view('admin/dosen/edit', [
            'title' => 'Ubah data Dosen',
            'validation' => \Config\Services::validation(),
            'page' => 'dosen',
            'dosen' => $dosen,
            'user' => $this->db->table('users')->where(['id' => $dosen['user_id']])->get()->getRowArray()
        ]);
---
SELECT *
FROM `dosen`
JOIN `users` ON `users`.`id` = `dosen`.`user_id`
WHERE `dosen`.`id` = '1'
 LIMIT 1
SELECT *
FROM `dosen`
WHERE `dosen`.`id` = '1'
 LIMIT 1
SELECT *
FROM `users`
WHERE `id` = '2'