app/Controllers/Admin/Dosen.php

SELECT *
FROM `dosen`
WHERE `dosen`.`id` = '1'
SELECT *
FROM `users`
WHERE `id` = '2'
---
    public function edit($id)
    {
        $dosen = $this->dosenModel->where(['dosen.id' => $id])->first();
        return view('admin/dosen/edit', [
            'title' => 'Ubah data Dosen',
            'validation' => $this->validation,
            'page' => 'dosen',
            'dosen' => $dosen,
            'user' => $this->db->table('users')->where(['id' => $dosen['user_id']])->get()->getRowArray()

UPDATE `dosen` SET `prodi_id` = NULL, `email_telkom` = 'dedy@telkomuniversity.ac.id', `nama` = 'Dedy Rahman Wijaya', `nama_gelar` = 'Dr. Dedy Rahman Wijaya, S.T., M.T.', `nip` = '5172', `nidn` = '12345', `kode` = 'DRWS', `telepon` = '+62 822-1914-73499', `alamat` = 'Denpasar', `foto` = 'dosen/user.png', `updated_at` = '2023-05-15 17:21:52'
WHERE `dosen`.`id` IN ('$i')
---
        }


        $this->dosenModel->save([
            'id' => $id,
            'prodi_id' => $this->request->getVar('prodi_id'),
            'email_telkom' => $this->request->getVar('email_telkom'),
            'nama' => $this->request->getVar('nama'),
            'nama_gelar' => $this->request->getVar('nama_gelar'),
            'nip' => $this->request->getVar('nip'),
            'nidn' => $this->request->getVar('nidn'),
            'kode' => $this->request->getVar('kode'),
            'telepon' => $this->request->getVar('telepon'),
            'alamat' => $this->request->getVar('alamat'),
            'foto' => $nama_file,
            'kode' => $this->request->getVar('kode')
        ]);