app/Controllers/Admin/Lomba.php

SELECT *
FROM `lomba`
---
    public function index()
    {
        $data_lomba = $this->lombaModel->findAll();

SELECT *
FROM `lomba`
WHERE `lomba`.`id` = '66'
---
    public function edit($id)
    {
        $lomba = $this->lombaModel->find($id);