app/Controllers/Admin/Prodi.php

    public function index()
    {
        $data_prodi = $this->prodiModel->findAll();
---
SELECT *
FROM `prodi`

        }


        $this->prodiModel->save([
            'id' => $id,
            'kode' => $this->request->getVar('kode'),
            'singkatan' => $this->request->getVar('singkatan'),
            'nama' => $this->request->getVar('nama'),
            'keterangan' => $this->request->getVar('keterangan')
        ]);
---
UPDATE `prodi` SET `kode` = 'D3SI', `singkatan` = 'D3SI', `nama` = 'D3 Sistem Informasi', `keterangan` = 'Akreditasi A', `updated_at` = '2023-05-15 17:20:22'
WHERE `prodi`.`id` IN ('$i')