app/Controllers/Home.php

    public function perlombaan()
    {
        $data_lomba = $this->lombaModel->join('kategori_lomba', 'kategori_lomba.id=lomba.kategori_lomba_id')->findAll();
        $data_kategori_lomba = $this->kategoriLombaModel->findAll();
---
SELECT `lomba`.*, `kategori_indo`
FROM `lomba`
JOIN `kategori_lomba` ON `kategori_lomba`.`id`=`lomba`.`kategori_lomba_id`
SELECT *
FROM `lomba`
SELECT *
FROM `kategori_lomba`

    public function detail_perlombaan($slug)
    {
        $lomba = $this->kategoriLombaModel->where('slug', $slug)->first();
---
SELECT *
FROM `lomba`
WHERE `slug` = 'gemastik-programming-2022'
 LIMIT 1